characteres_diferenciados = '''
ƒ ” … † ‡ ˆ ‰ Š ‹ Œ Ž • – — š › œ ž Ÿ ¡ ¢ £ ¤ ¥ ¦ § ¨ © ª « ¬ ® ¯ ± ´ µ ¶ · ¸ » ¼ ½ ¾ ¿ Æ Ð × Ø Þ ß å æ ð ó ô õ ö ÷ ø þ Đ đ Ħ Œ œ ƀ Ƃ ƃ Ƅ ƅ Ɔ Ɖ Ƌ ƌ ƍ Ǝ Ə Ɛ Ƒ ƒ Ɣ ƕ Ɩ Ɨ ƚ ƛ Ɯ Ɲ ƞ Ɵ Ơ ơ Ƣ ƣ Ƥ ƥ Ʀ Ƨ ƨ Ʃ ƪ Ʊ Ʒ Ƹ ƹ ƺ ƻ Ƽ ƽ ƾ ƿ ǀ ǁ ǂ ǝ Ƿ ȡ Ȣ ȣ ȸ ȹ ɷ ɸ ʘ Φ Ψ Ω φ ψ Ϟ ϟ Ϫ Ѽ Ѿ ҈ ҉ Ա Բ Գ Դ Ե Զ Է Ը Թ Ժ Ի Լ Խ Ծ Կ Հ Ձ Ղ Ճ Մ Յ Ն Շ Ո Չ Պ Ջ Ռ Ս Վ Տ Ր Ց Ւ Փ Ք Օ Ֆ ۝ ۞ ۩ ߷

 ᚛ ᚜ ᚢ ᚣ ᚤ ᚥ ᚦ ᚧ ᚨ ᚩ ᚪ ᚫ ᚬ ᚭ ᚮ ᚯ ᚰ ᚱ ᚲ ᚳ ᚴ ᚵ ᚶ ᚷ ᚸ ᚹ ᚺ ᚻ ᚼ ᚽ ᚾ ᚿ ᛀ ᛁ ᛂ ᛃ ᛄ ᛅ ᛆ ᛇ ᛈ ᛉ ᛊ ᛋ ᛌ ᛍ ᛎ ᛏ ᛐ ᛑ ᛒ ᛓ ᛔ ᛕ ᛖ ᛗ ᛘ ᛙ ᛚ ᛛ ᛜ ᛝ ᛞ ᛟ ᛠ ᛡ ᛢ ᛣ ᛤ ᛥ ᛦ ᛨ ᛩ ᛪ ᛫ ᛭ ᛮ ᛯ ᛰ ៳ ៴ ៵ ៶ ៷ ៸ ៹ ᠀ ᠁ ᠅ ᠉ ᢀ ᢁ ᢂ 

 Ↄ ↄ


─ ━ │ ┃ ┄ ┅ ┆ ┇ ┈ ┉ ┊ ┋ ┌ ┍ ┎ ┏ ┐ ┑ ┒ ┓ └ ┕ ┖ ┗ ┘ ┙ ┚ ┛ ├ ┝ ┞ ┟ ┠ ┡ ┢ ┣ ┤ ┥ ┦ ┧ ┨ ┩ ┪ ┫ ┬ ┭ ┮ ┯ ┰ ┱ ┲ ┳ ┴ ┵ ┶ ┷ ┸ ┹ ┺ ┻ ┼ ┽ ┾ ┿ ╀ ╁ ╂ ╃ ╄ ╅ ╆ ╇ ╈ ╉ ╊ ╋ ╌ ╍ ╎ ╏ ═ ║ ╒ ╓ ╔ ╕ ╖ ╗ ╘ ╙ ╚ ╛ ╜ ╝ ╞ ╟ ╠ ╡ ╢ ╣ ╤ ╥ ╦ ╧ ╨ ╩ ╪ ╫ ╬ ╭ ╮ ╯ ╰ ╱ ╲ ╳ ╴ ╵ ╶ ╷ ╸ ╹ ╺ ╻ ╼ ╽ ╾ ╿

wiggs > ╱╱╱╱╱╳╲

'''
jose = '''
   ___
 ╼╪═══╪╾
 ┌┤  òó
 └┤ ╔_┛
  └─╜╜╜
'''
maria = '''

ƝƝƝƝƝƝƝ
Ɲ╭┤Ɲ óò
Ɲ╰┤  _┛
ƝƝ╰───╯
'''
char = '''

  ԹՂᚶՁԻ
 ┌┤  ԾԾ
 ╰┤  _┛
  ╰───┘
'''